# # Написати і запустити першу програму Hello World !
# print ("Hello Word!")
# #Написати програму, яка б виводила Hello, {your name} 3 рази
# print("Hello Stas! "*3)
# # Вивести Дзен Пайтона
# import this
# print(this)
# #Вивести через print наступне: 1-->2-->3-->4-->5 (з використанням sep)
# print(1, 2, 3, 4, 5, sep=("-->"))
# # Вивести через print Hello world ! І виконати 5 перенесень строк (з використанням end)
# print("Hello Word!!", end="\n"*5)
# # Присвойте lang = ‘python’
# # Виведіть в одному рядку символи ‘p’, ‘t’ ‘n’ з цього слова, використовуючи доступ через індекси. Для виведення останнього символу (‘n’ ) використайте функцію len().
# # Отримайте символ з індексом 10.
# lang = "python"
# print(lang[0], lang[2], lang[-1])
# print(lang[10])
# 2. Використайте методи для роботи з рядками, та реалізуйте для lang = ‘python’:
# - перший символ – велика буква
# - всі символі – великі букви
# lang = 'python'
# print(lang.title(), lang.upper(), lang.capitalize())
# 3. Визначте тип змінної lang.
# print(type(lang))

# 4. Виконайте операції:
# - цілий залишок від ділення 7 на 2
# - остача від ділення 7 на 2
# - 3 в степені 4
# print(7//2, 7%2, 3**4)
# # Виведіть результати задачі 5, як рядки (тип str)
# a = str(7%2)
# print(a, type(a))
#
# # 6. Маємо змінну a = 1.51
# #  Чому буде дорівнювати int(a), round(a) ? Спочатку дайте усну відповідь, потім перевірте в коді.
#
# #int(a) будет равняться 1, так как функция  int не округляет математически число, а отбрасывает знаки после точки, оставляя целое число
# #round(a) математически округляет число, будет 2
# a = 1.51
# print(int(a), round(a))